Autodesk.Navisworks.Api.DataProperty
Named property with data value. Immutable.

Autodesk.Navisworks.Api.DataProperty.#ctor(Autodesk.Navisworks.Api.NamedConstant,Autodesk.Navisworks.Api.VariantData)
Create a property from a combined name and display name
Throws System.ArgumentException:
Argument 'combinedName' has been Disposed
Throws System.ArgumentNullException:
Argument 'data' is null
Throws System.ArgumentException:
Argument 'data' has been Disposed

Autodesk.Navisworks.Api.DataProperty.#ctor(System.String,System.String,Autodesk.Navisworks.Api.VariantData)
Create a property from separate name and display name
Throws System.ArgumentNullException:
Argument 'value' is null
Throws System.ArgumentException:
Argument 'value' has been Disposed

Autodesk.Navisworks.Api.DataProperty.CombinedName
Combined name of property
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.DataProperty.DisplayName
Diplay name (localized, suitable for display to end user)
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.DataProperty.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.DataProperty.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.DataProperty.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.DataProperty.Name
Name of property (suitable for programmatic use)
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.DataProperty.ParseCompatibleValue(System.String)
Parses formattedValue into a value compatible (same type and formatting) with the current Value.
Returns: Parsed value
Throws System.FormatException:
formattedValue is not in a format compatible with the current value.

Autodesk.Navisworks.Api.DataProperty.ToString
Returns a  that represents the current .
Returns: A  that represents the current .

Autodesk.Navisworks.Api.DataProperty.TryParseCompatibleValue(System.String)
Try to parse formattedValue into a value compatible (same type and formatting) with the current Value. Returns a value with type of None on failure
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.DataProperty.Value
Value of the property
Throws System.ObjectDisposedException:
Object has been Disposed